增加了关闭程序时候的动作，不过好像不起作用
