--- a/33.DotNettyProtobufClient1/readme.md
+++ b/33.DotNettyProtobufClient1/readme.md
@@ -109,29 +109,40 @@ public class ClientHandler : SimpleChannelInboundHandler<MyMessage>
 
 #### 8. 断线重连
-断线重连的程序运行逻辑如下：
-```plantuml
+断线重连的程序运行逻辑如下：（因为PlantUML的图在Github中无法显示所以用mermaid图表）
+```mermaid
+---
+title: 程序运行逻辑
+---
+flowchart TD
+   A([Start]) --> A1[Init ConnectManager]
+   A1[Init ConnectManager]-->B[ConnectAsync]
+   B --> C{connected}
+   C -- No --> D[ReconnectedAsync]
+   
+   C -- Yes --> E[ChannelActive]
+   E --> F{ExceptionCaught}
+   F -- Yes --> G[ChannelInActive]
+   G --> D
+   
+   D[ReconnectedAsync]-->D2{_isReconnecting}
+   D2 -- No --> D3[Channel State]
+   D3 --> D4[Wait For Seconds]
+   D4 -->B[ConnectAsync]
+     
+   
 
-
-@startuml
-start
-
-:ConnectAsync;
-if (connected?) then (Yes)
-:ChannelActive;
-if (Exception?) then (Yes)
-:ChannelInActive;
-:Reconnected Async;
--> ConnectAsync;
-else (No)
--> ChannelActive;
-endif
-else (No)
-:Reconnected Async;
--> ConnectAsync;
-endif
-
-stop
-@enduml
 ```
-具体过程
+具体过程：
+1. 初始化``ConnectManager``，``ConnectManager``作为管理整个链接的实际对象，输入参数为IP和端口，``ConnectManager``的构造函数的入口参数，注意，初始化``ConnectManager``时也初始化了``EventLoopGroup``,有且只有一次，注意这里一定需要加阻塞过程，这里用的是``Console.ReadLine()``，否则如果重连失败主线程会直接退出
